3

In [54]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

4

In [55]:
%matplotlib inline

5

In [56]:
gdp_df = pd.read_csv("../Data/gdp_percapita.csv", nrows=6868)

In [57]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6868 entries, 0 to 6867
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6868 non-null   object
 1   Year             6868 non-null   int64
 2   Value            6868 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 214.8+ KB

6

In [58]:
internet_df = pd.read_csv("../Data/internet_use.csv", nrows=4495)

7

In [59]:
internet_df.shape

(4495, 4)

In [60]:
gdp_df.shape

(6868, 4)

8 - module error

In [61]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [62]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

9

In [63]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [64]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6858        Zimbabwe  1999  3600.849291              NaN
6859        Zimbabwe  1998  3653.920016              NaN
6860        Zimbabwe  1997  3580.048793              NaN
6861        Zimbabwe  1996  3520.430146              NaN
6862        Zimbabwe  1995  3226.413930              NaN
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

10

In [65]:
del internet_df['Value Footnotes']

In [66]:
del gdp_df['Value Footnotes']

In [67]:
11

11

In [68]:
internet_df.rename(columns={'Country or Area':'Country', 'Value': 'GDP_per_Capita'})

          Country  Year  GDP_per_Capita
0     Afghanistan  2014        6.390000
1     Afghanistan  2013        5.900000
2     Afghanistan  2012        5.454545
3     Afghanistan  2011        5.000000
4     Afghanistan  2010        4.000000
...           ...   ...             ...
4490     Zimbabwe  1997        0.033080
4491     Zimbabwe  1996        0.016790
4492     Zimbabwe  1995        0.007684
4493     Zimbabwe  1994        0.001739
4494     Zimbabwe  1990        0.000000

[4495 rows x 3 columns]

13

In [69]:
gdp_df.rename(columns={'Country or Area':'Country', 'Value': 'Internet_Users_Pct'})

          Country  Year  Internet_Users_Pct
0     Afghanistan  2019         2065.036398
1     Afghanistan  2018         2033.779002
2     Afghanistan  2017         2058.383832
3     Afghanistan  2016         2057.062164
4     Afghanistan  2015         2068.265904
...           ...   ...                 ...
6863     Zimbabwe  1994         3263.934978
6864     Zimbabwe  1993         3033.504852
6865     Zimbabwe  1992         3054.889178
6866     Zimbabwe  1991         3426.598094
6867     Zimbabwe  1990         3324.348171

[6868 rows x 3 columns]

14

In [78]:
df3 = pd.merge(internet_df, gdp_df, on='Year')

15

In [79]:
df3.tail(5)

        Country or Area_x  Year   Value_x Country or Area_y      Value_y
1003631     United States  1991  1.163194           Vanuatu  2897.327707
1003632     United States  1991  1.163194           Vietnam  1736.014139
1003633     United States  1991  1.163194             World  9645.256163
1003634     United States  1991  1.163194            Zambia  2133.689042
1003635     United States  1991  1.163194          Zimbabwe  3426.598094

16

TypeError: 'set' object is not subscriptable